{"_id":{"$oid":"5d8262852e9422a0c643b637"},"Title":"Aladdin","Description":"Aladdin is a lovable street urchin who meets Princess Jasmine, the beautiful daughter of the sultan of Agrabah. While visiting her exotic palace, Aladdin stumbles upon a magic oil lamp that unleashes a powerful, wisecracking, larger-than-life genie. As Aladdin and the genie start to become friends...","Genre":{"Name":"Romance","Description":"Romance is a narrative genre in literature that involves a mysterious, adventurous, or spiritual story line where the focus is on a quest that involves bravery and strong values, not always a love interest."},"Director":{"Name":"Guy Ritchie","Bio":"Guy Ritchie was born in Hatfield, Hertfordshire, UK on September 10, 1968. After watching Butch Cassidy and the Sundance Kid (1969) as a child, Guy realized that what he wanted to do was make films. He never attended film school, saying that the work of film school graduates was boring and unwatchable.","Birth":"1968-09-10"},"ImagePath":"aladdin.png","Fetured":true}
{"_id":{"$oid":"5d8262852e9422a0c643b638"},"Title":"Arthur 3: The War of Two Worlds","Description":"The film begins with nothing left to lose, Arthur must begin to grow back to his normal size and faces Maltazard in massive final battle as Maltazard threatens to take over the entire universe.","Genre":{"Name":"Fantasy","Description":"Fantasy films are films that belong to the fantasy genre with fantastic themes, usually magic, supernatural events, mythology, folklore, or exotic fantasy worlds. The genre is considered a form of speculative fiction alongside science fiction films and horror films, although the genres do overlap."},"Director":{"Name":"Luc Besson","Bio":"Luc Besson, born 18 March 1959 is a French film director, writer and producer. He is the creator of EuropaCorp film company. He has been involved with over 50 films, spanning 26 years, as writer, director, and/or producer.","Birth":"1959-03-18"},"ImagePath":"arthur3thewaroftwoworlds.png","Fetured":true}
{"_id":{"$oid":"5d8262852e9422a0c643b639"},"Title":"The Extraordinary Adventures of Adèle Blanc-Sec","Description":"A 136 million-year old pterodactyl egg, housed on a shelf in the Natural History Museum, has mysteriously hatched, unleashing a prehistoric monster onto the Parisian streets. But nothing fazes Adèle, when she finds a connection with the ancient bird and reveals many more extraordinary surprises...","Genre":{"Name":"Adventure","Description":"Adventure films are often set in a period background and may include adapted stories of historical or fictional adventure heroes within the historical context. ... Adventure films may also be combined with other movie genres such as action, animation, comedy, drama, fantasy, science fiction, family, horror or war."},"Director":{"Name":"Luc Besson","Bio":"Luc Besson, born 18 March 1959 is a French film director, writer and producer. He is the creator of EuropaCorp film company. He has been involved with over 50 films, spanning 26 years, as writer, director, and/or producer.","Birth":"1959-03-18"},"ImagePath":"adeleblancsec.png","Fetured":true}
{"_id":{"$oid":"5d8262852e9422a0c643b63a"},"Title":"Alice in Wonderland","Description":"Lewis Carroll - Alice In Wonderland is about a young girl, Alice, who is sitting along the bank of a river when she notices a rabbit in clothing run by. The rabbit says he is late and jumps down a hole through which Alice follows.","Genre":{"Name":"Fantasy","Description":"Fantasy films are films that belong to the fantasy genre with fantastic themes, usually magic, supernatural events, mythology, folklore, or exotic fantasy worlds. The genre is considered a form of speculative fiction alongside science fiction films and horror films, although the genres do overlap."},"Director":{"Name":"Tim Burton","Bio":"Tim Burton was born Timothy Walter Burton on August 25, 1958, in Burbank, California. ... Within a year, Burton grew tired with his work at Disney and decided to strike out on his own. In 1982, he released the award-winning short Vincent, which paid homage to the enduring work of his childhood idol.","Birth":"1958-08-25"},"ImagePath":"aliceinwonderland.png","Fetured":true}
{"_id":{"$oid":"5d8262852e9422a0c643b63b"},"Title":"Dumbo","Description":"Dumbo is a 2019 American fantasy adventure film directed by Tim Burton, with a screenplay by Ehren Kruger. The film is a live-action reimagining of Walt Disney 1941 animated film of the same name, which was based on the novel by Helen Aberson and Harold Pearl.","Genre":{"Name":"Fantasy","Description":"Fantasy films are films that belong to the fantasy genre with fantastic themes, usually magic, supernatural events, mythology, folklore, or exotic fantasy worlds. The genre is considered a form of speculative fiction alongside science fiction films and horror films, although the genres do overlap."},"Director":{"Name":"Tim Burton","Bio":"Tim Burton was born Timothy Walter Burton on August 25, 1958, in Burbank, California. ... Within a year, Burton grew tired with his work at Disney and decided to strike out on his own. In 1982, he released the award-winning short Vincent, which paid homage to the enduring work of his childhood idol.","Birth":"1958-08-25"},"ImagePath":"dumbo.png","Fetured":true}
{"_id":{"$oid":"5d8262852e9422a0c643b63c"},"Title":"Warcraft","Description":"Warcraft (alternatively known as Warcraft: The Beginning)[4] is a 2016 American action fantasy film directed by Duncan Jones and written by Charles Leavitt and Jones. Based on the video game series of the same name, the film stars Travis Fimmel, Paula Patton, Ben Foster, Dominic Cooper, Toby Kebbell, Ben Schnetzer, Robert Kazinsky, Clancy Brown and Daniel Wu. The film portrays the initial encounters between the humans and the orcs and takes place in a variety of locations established in the video game series.","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonist or protagonists are thrust into a series of events that typically include violence, extended fighting, physical feats, and frantic chases."},"Director":{"Name":"Duncan Jones","Bio":"Duncan Zowie Haywood Jones is a British-American film director, producer and screenwriter. He is best known for directing the science fiction film Moon, for which he won the BAFTA Award for Outstanding Debut by a British Writer, Director or Producer. He also directed Source Code, Warcraft and Mute. ","Birth":"1971-05-30"},"ImagePath":"warcraft.png","Fetured":true}
{"_id":{"$oid":"5d8262852e9422a0c643b63d"},"Title":"The Twilight Saga: Breaking Dawn - Part 1","Description":"In The Twilight Saga: Breaking Dawn is divided into three separate parts. The first part details Bellas marriage and honeymoon with Edward, which they spend on Isle Esme, a private island off the coast of Brazil that Carlisle owns. ... A month after the wedding, Bella calls her father, Charlie Swan, and says that she is sick.","Genre":{"Name":"Romance","Description":"Romance is a narrative genre in literature that involves a mysterious, adventurous, or spiritual story line where the focus is on a quest that involves bravery and strong values, not always a love interest."},"Director":{"Name":"Bill Condon","Bio":"William Condon (born October 22, 1955) is an American screenwriter and director. He wrote and directed the films Gods and Monsters (1998), Kinsey (2004), and Dreamgirls (2006), wrote the screenplay for Chicago (2002), and directed the final two installments of the Twilight series (2011, 2012), and the live-action adaptation of Disneys Beauty and the Beast (2017). Condon won an Oscar as screenwriter for Gods and Monsters and was nominated for his screenplay for Chicago.","Birth":"1955-10-22"},"ImagePath":"twilightsaga1.png","Fetured":true}
{"_id":{"$oid":"5d8262852e9422a0c643b63e"},"Title":"The Secret Life of Walter Mitty","Description":"The Secret Life of Walter Mitty tells the story of the aging Walter Mitty on a trip into town with his overbearing wife, Mrs. Mitty. Walter is inept at many things; he is an absent-minded driver, he cant handle simple mechanical tasks, and he forgets things easily. What makes Walter exceptional is his imagination.","Genre":{"Name":"Adventure","Description":"Adventure films are often set in a period background and may include adapted stories of historical or fictional adventure heroes within the historical context. ... Adventure films may also be combined with other movie genres such as action, animation, comedy, drama, fantasy, science fiction, family, horror or war."},"Director":{"Name":"Ben Stiller","Bio":"Early Life and Career. Actor, comedian. Born on November 30, 1965, in New York City, Ben Stiller was the second child of famed comedians Jerry Stiller and Anne Meara. Raised on Manhattans Upper West Side, he attended the University of California at Los Angeles, but left in 1984 after only nine months.","Birth":"1965-10-30"},"ImagePath":"thesecretlifeofwm.png","Fetured":true}
{"_id":{"$oid":"5d8262852e9422a0c643b63f"},"Title":"Abandoned","Description":"Mary Walsh delivers boyfriend Kevin to a hospital for routine outpatient surgery. But when Mary returns to take him home, hes mysteriously vanished. An administrator can find no record of ...","Genre":{"Name":"Thriller","Description":"Thriller', 'Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Michael Feifer","Bio":"Michael Feifer was born on September 11, 1968 in Brooklyn, New York, USA. He is a producer and director, known for Abandoned (2010), Merry Kissmas (2015) and A Christmas Wedding Tail (2011). He has been married to Caia Coley since April 14, 2001. They have one child.","Birth":"1968-09-11"},"ImagePath":"abandoned.png","Fetured":true}
{"_id":{"$oid":"5d8262852e9422a0c643b640"},"Title":"Killers","Description":"A vacationing woman meets her ideal man, leading to a swift marriage. Back at home, however, their idyllic life is upset when they discover their neighbors could be assassins who have been contracted to kill the couple..","Genre":{"Name":"Thriller","Description":"Thriller', 'Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Robert Luketic","Bio":"Robert Luketic was born on November 1, 1973 in Sydney, New South Wales, Australia. He is a director and writer, known for The Ugly Truth (2009), Killers (2010) and 21 (2008).","Birth":"1973-11-01"},"ImagePath":"killers.png","Fetured":true}
